package days07;

/**
 * @author pilot
 * @date 2023. 7. 21. - 오후 3:28:33
 * @subject	메서드(함수) 설명
 * @content
 */
public class Ex08 {

	public static void main(String[] args) {
		//	1.	정의:	프로그래밍에서 "반복되는 명령어들"을 찾아서 별도로 묶어서 필요할 때 마다 재사용 하도록 만든 것.
		//	2.	프로그램 구조화 -> 유지,보수 관리 용이
		//	3.	함수가 기본이 되는 프로그래밍 방식 - 구조적 프로그램
		//	4.	객체가 기본이 되는 프로그래밍 방식 - 객체 지향적 프로그래밍[OOP]
		//	5.	메서드(함수)의 선언 형식
		//	접근지정자+기타제어자 = 수정자(modifier)
		//	[접근 지정자][기타제어자]리턴자료형 함수명 ([매개변수...]) <- 함수의 프로토타입
		//	{ -> 함수의 몸체
		//			[return 리턴값;]
		//	}
		//	6.	함수 3가지 파악(이해) = 기능 + 매개변수 + 리턴값(리턴자료형)
	} // main
}
