package days03;

public class Ex05 {
	public static void main(String[] args) {
		/*
		 * 1. 연산자(operator)
		 * 		ㄱ.	정의:	연산을 수행하는 기호
		 * 			예)		+ - * / ; [] () 등등
		 * 2. 피연산자(operand)
		 * 		ㄱ.	연산자의 처리(작업)대상
		 * 		ㄴ.	피연산자의 갯수 따라서 연산자를 구분
		 * 			1개:	단항 연산자
		 * 			2개:	이항 연산자	3 + 4
		 * 			3개:	삼항 연산자
		 * 3.	식(expression)
		 * 		ㄱ.	연산자와 피연산자를 조합하여 표현한 것.
		 * 			예) 3+ 4		!4		4 > 3
		 * 
		 * 	4.	연산자의 종류(기능 따라)
		 * 		ㄱ.	산술연산자	+	-	+	/	Ex05_02
		 * 		ㄴ.	비교연산자	>	<	>=	<=	==	!=		Ex05_03
		 * 		ㄷ.	논리연산자
		 * 		ㄹ.	대입연산자
		 * 		ㅁ.	기타
		 * */
	}
}
